title: Potential Container Escape via Socket
id: f1e2d3c4-b5a6-7890-h1i2-j3k4l5m6n7o8
status: stable
description: Detects Docker commands from non-privileged containers
author: IkwukaCySec
date: 2026-01-01
logsource:
    category: process_creation
detection:
    selection:
        Image|contains: 'docker exec' OR 'docker ps'
        AND ParentImage|contains: '/uptime-checker'
    condition: selection
falsepositives:
    - Legitimate admin
level: critical
